//ᚠᛇᚻ᛫ᛒᛦᚦ᛫ᚠᚱᚩᚠᚢᚱ᛫ᚠᛁᚱᚪ᛫ᚷᛖᚻᚹᛦᛚᚳᚢᛗ
//ᛋᚳᛖᚪᛚ᛫ᚦᛖᚪᚻ᛫ᛗᚪᚾᚾᚪ᛫ᚷᛖᚻᚹᛦᛚᚳ᛫ᛗᛁᚳᛚᚢᚾ᛫ᚻᛦᛏ᛫ᛞᚫᛚᚪᚾ
//ᚷᛁᚠ᛫ᚻᛖ᛫ᚹᛁᛚᛖ᛫ᚠᚩᚱ᛫ᛞᚱᛁᚻᛏᚾᛖ᛫ᛞᚩᛗᛖᛋ᛫ᚻᛚᛇᛏᚪᚾ᛬

namespace alpha
{
	class B : /*private*/UknownTemplatedClass<beta::A>, public beta::A
	{
	public:

		/*********************
		Τὴ γλῶσσα μοῦ ἔδωσαν ἑλληνικὴ
		τὸ σπίτι φτωχικὸ στὶς ἀμμουδιὲς τοῦ Ὁμήρου.
		Μονάχη ἔγνοια ἡ γλῶσσα μου στὶς ἀμμουδιὲς τοῦ Ὁμήρου.
		ἀπὸ τὸ Ἄξιον ἐστί
		τοῦ Ὀδυσσέα Ἐλύτη
		*/////////////////////
		
		/*На берегу пустынных волн
		 *Стоял он, дум великих полн,
		 *И вдаль глядел. Пред ним широко
		 *Река неслася; бедный чёлн
		 *По ней стремился одиноко.
		 *По мшистым, топким берегам
		 *Чернели избы здесь и там,
		 *Приют убогого чухонца;
		 *И лес, неведомый лучам
		 *В тумане спрятанного солнца,
		 *Кругом шумел.
		*/
		
		int Func_HeaderDefined() override
		{
			// Here somebody forgot to call A::Func_HeaderDefined()
			return 0;
		}
		
		int Func_Super() const;
		
		[[csc::call_super]]
		void Func_1();
	};
}